<!doctype html>
<html>

<head>
<meta charset="utf-8">
<title>No&tcedil;iunea de algoritm</title>
<link rel="stylesheet" type="text/css" href="css/alg.css">
</head>

<body>
	
<div id="navi">
    <div class="box" id="banner">
		<h1 align="center">Algoritmi</h1>
    <ul id="menu">
		<li><a href="index.html">Acas&abreve;</a></li>
		<li><a href="alg1.html"><b>No&tcedil;iunea de algoritm</b></a></li>
		<li><a href="alg2.html">Date &scedil;i opera&tcedil;ii asupra lor</a></li>
		<li><a href="alg3.html">Expresii &scedil;i operatori</a></li>
		<li><a href="alg4.html">Exerci&tcedil;ii</a></li>
	</ul>
</div>
</div>

<div id="text">
	<p>Computerul este o ma&scedil;ina de calcul creat&abreve; &scedil;i dezvoltat&abreve; de om pentru a putea prelucra informa&tcedil;iile rapid, exact &scedil;i cu eforturi mici.
	Pentru a avea acces la informa&tcedil;ii, acestea vor fi &icirc;ntroduse &icirc;n prealabil &icirc;n calculator. Informa&tcedil;iile devin astfel <i>date</i>. Calculatorul
	ac&tcedil;ioneaz&abreve; asupra lor, prelucr^&acirc;ndu-le, iar omul are acces asupra acestor date, interpret&acirc;ndu-le.</p>
	<p>Nu orice problem&abreve; poate fi rezolvat&abreve; cu ajutorul calculatorului. Pot fi rezolvate doar problemele pentru care au fost identificate cu stricte&tcedil;e
	&scedil;i &icirc;ntr-o ordine determinat&abreve; toate etapele ce duc la solu&tcedil;ia problemei.</p>
	<p><b>Algoritmul</b> este, astfel, succesiunea finit&abreve; de pasi, bine delimita&tcedil;i &scedil;i determina&tcedil;i ce duc f&abreve;r&abreve; echivoc la rezolvarea unei probleme.</p>
	<p><b>Caracteristicile/Condi&tcedil;iile unui alogoritm:</b></p>
	<ol>
		<li><p><i>Finitate.</i> Num&abreve;rul de pa&scedil;i trebuie s&abreve; fie limitat. Nerespectarea acestei condi&tcedil;ii duce la &icirc;ntrarea &icirc;ntr-un ciclu infinit.</p></li>
		<li><p><i>Claritate.</i> To&tcedil;i pa&scedil;ii algoritmului trebuie s&abreve; fie enunta&tcedil;i &scedil;i defini&tcedil;i clar, f&abreve;r&abreve; echivoc, &icirc;ntr-o succesiune precis&abreve;, bine determinat&abreve;.</p></li>
		<li><p><i>Eficien&tcedil;a.</i> Un algoritm adev&abreve;r&abreve;t eficient este cu at&acirc;t mai util cu c&acirc;t num&abreve;rul de pa&scedil;i ce &icirc;l compun este mai mic, dar f&abreve;r&abreve; a afecta 
		corectitudinea solu&tcedil;iei furnizate.
		</p></li><li><p><i>Universalitate.</i> Un algoritm este folositor doar dac&abreve; duce la rezolvarea unei clase de probleme, nu doar a unei situa&tcedil;ii particulare. 
		Diferitele probleme din interiorul unei clase difer&abreve; prin datele de intrare furnizate.</p></li>
		<li><p><i>Realizabilitate.</i> Aceasta caracteristic&abreve; se refer&abreve; la adoptarea unor solu&tcedil;ii posibile &scedil;i realizabile &icirc;n resursele aflate la dispozi&tcedil;ie
		(software, hardware, de timp, etc).</p></li>
	</ol>
	<p><b>Reprezentarea algoritmilor:</b></p>
	<ol>
		<li><p><i>Metoda scrierii &icirc;n pseudocod.</i> Pseudocodul este un fals limbaj de scriere a pa&scedil;ilor componen&tcedil;i &scedil;i folose&scedil;te anumite cuvinte cheie pentru
		a descrie intructiunile ce &icirc;l compun. Are avantajul de a nu fi legat de o anumit&abreve; sintax&abreve;, &icirc;ns&abreve; dezavantajul major este ca nu este "&icirc;n&tcedil;eles" de c&abreve;tre 
		computer, deci nu duce la o solu&tcedil;ie practic&abreve;.</p></li>
		<li><p><i>Metoda scrierii folosind scheme logice.</i> Elemente grafice descriu structurile, instruc&tcedil;iunile &scedil;i succesiunea acestora. Pe de o parte, 
		schemele logice sunt clare &scedil;i usor de inteles. Pe de alta parte, un algoritm complex necesit&abreve; o schem&abreve; logic&abreve; extrem de ramificat&abreve;.</p></li>
		<li><p><i>Metoda scrierii folosind limbaje de programare.</i> Avantajul evident este acela c&abreve; problema va fi rezolvat&abreve; efectiv dupa transcrierea &icirc;n 
		limbajul respectiv, instruc&tcedil;iunile fiind executate apoi de un compilator. Cunoa&scedil;terea detaliat&abreve; a sintaxei, instruc&tcedil;iunilor &scedil;i a modalit&abreve;&tcedil;ilor concrete
		de programare a limbajului &scedil;i mediului alese ar putea reprezenta un dezavantaj al acestei metode.</p></li>
	</ol>
	<br/>
</div>

	
</body>

</html>

