<!doctype html>
<html>

<head>
<meta charset="utf-8">
<title>Exerci&tcedil;ii</title>
<link rel="stylesheet" type="text/css" href="css/fundam.css">
</head>

<body>
	
<div id="navi">
    <div class="box" id="banner">
		<h1 align="center">Algoritmi fundamentali</h1>
    <ul id="menu">
		<li><a href="index.html">Acas&abreve;</a></li>
		<li><a href="fundam1.html">Operarea pe cifre</a></li>	
		<li><a href="fundam3.html">Divizorii unui num&abreve;r</a></li>
		<li><a href="fundam2.html">C.m.m.d.c</a></li>
		<li><a href="fundam4.html"><b>Exerci&tcedil;ii</b></a></li>
	</ul>
</div>
</div>

<div id="text">
	<ol type='I'>
	<li><b>Operare pe cifre</b>
		<ol>
		<li>Se cite&scedil;te un num&abreve;r natural n. Determina&tcedil;i &scedil;i afi&scedil;a&tcedil;i num&abreve;r suma cifrelor pare &scedil;i produsul cifrelor impare ale num&abreve;rului n. 
		(num&abreve;rul introdus are cel pu&tcedil;in o cifr&abreve; par&abreve; &scedil;i cel pu&tcedil;in una impar&abreve;)</li>
		<li>Se cite&scedil;te un num&abreve;r natural n. S&abreve; se verifice dac&abreve; are toate cifrele egale.</li>
		<li>Se citesc un num&abreve;r natural n de maxim nou&abreve; cifre &scedil;i o cifr&abreve; c(0&le;c&le;9). S&abreve; se determine &scedil;i s&abreve; se afi&scedil;ze c&acirc;te cifre c con&tcedil;ine num&abreve;rul n.</li>
		<li>Se cite&scedil;te un num&abreve;r natural n de maxim nou&abreve; cifre. S&abreve; se determine &scedil;i s&abreve; se afi&scedil;ze din c&acirc;te cifre nenule este alc&abreve;tuit num&abreve;rul.</li>
		<li>Se cite&scedil;te un num&abreve;r natural n de maxim nou&abreve; cifre. S&abreve; se afi&scedil;ze un mesaj corespunz&abreve;tor dac&abreve; cifrele lui n sunt ordonate cresc&abreve;tor de la dreapta la st&acirc;nga.</li>
		<li>Se cite&scedil;te un num&abreve;r natural n de maxim nou&abreve; cifre. S&abreve; se determine &scedil;i s&abreve; se afi&scedil;ze suma cifrelor sale impare &scedil;i produsul cifrelor pare.</li>
		<li>Se cite&scedil;te un num&abreve;r natural n de maxim nou&abreve; cifre. S&abreve; se determine &scedil;i s&abreve; se afi&scedil;ze produsul dintre cifra sa maxim&abreve; &scedil;i cifra sa minim&abreve;.</li>
		<li>Se cite&scedil;te un num&abreve;r natural n de maxim nou&abreve; cifre. S&abreve; se determine dac&abreve; elimin&acirc;nd ultima cifr&abreve; a num&abreve;rul n se ob&tcedil;ine un num&abreve;r palindromic
		&scedil;i s&abreve; se afi&scedil;ze un mesaj corespunz&abreve;tor.</li>
		<li>Se cite&scedil;te un num&abreve;r natural n de maxim nou&abreve; cifre. S&abreve; se construiasc&abreve; &icirc;n memorie &scedil;i s&abreve; se afi&scedil;ze num&abreve;rul alc&abreve;tuit din cifrele divizibile cu 3, privite de la dreapta la
		st&acirc;nga. &Icirc;n cazul &icirc;n care n nu are cifre divizibile cu 3, s&abreve; se afi&scedil;ze un mesaj corespunz&abreve;tor.(pentru n=236509 se va afi&scedil;a 903)</li>
		<li>Se cite&scedil;te un num&abreve;r natural n de maxim nou&abreve; cifre. S&abreve; se construiasc&abreve; &icirc;n memorie &scedil;i s&abreve; se afi&scedil;ze num&abreve;rul alc&abreve;tuit din cifrele mai mari ca 4, privite de la 
		st&acirc;nga la dreapta. &Icirc;n cazul &icirc;n care n nu are cifre mai mari decat 4, s&abreve; se afi&scedil;ze un mesaj corespunz&abreve;tor.(pentru n=236509 se va afisa 659)</li>
		</ol>
	</li>
	<br/><li><b>Divizorii unui num&abreve;r</b>
		<ol>
		<li>S&abreve; se afi&scedil;ze num&abreve;rul divizorilor proprii ai unui num&abreve;r natural n de maxim 4 cifre.</li>
		<li>Se cite&scedil;te un num&abreve;r natural n de maxim 4 cifre. S&abreve; se determine cel mai mic divizor prim al s&abreve;u.</li>
		<li>Se cite&scedil;te un num&abreve;r natural n de maxim 4 cifre. Sa se determine cel mai mare divizor propriu al s&abreve;u.</li>
		<li>Se cite&scedil;te un num&abreve;r natural n de maxim 4 cifre. S&abreve; se determine cel mai mare num&abreve;r prim mai mic dec&acirc;t n &scedil;i cel mai mic num&abreve;r prim mai mare dec&acirc;t n.</li>
		<li>Se citesc dou&abreve; numere a, b(a>1, a&le;b, de maxim 4 cifre). S&abreve; se afi&scedil;ze toate numerele prime din intervalul [a, b]. Dac&abreve; nu exist&abreve; numere prime
		&icirc;n intervalul specificat s&abreve; se afi&scedil;ze un mesaj corespunz&abreve;tor.</li>
		<li>S&abreve; se determine &scedil;i s&abreve; se afi&scedil;ze primele n numere prime (0&le;n&le;20).</li>
		<li>Se cite&scedil;te un num&abreve;r natural n de minim patru &scedil;i maxim nou&abreve; cifre. S&abreve; se determine dac&abreve; elimin&acirc;nd ultimele 3 cifre ale num&abreve;rului n se ob&tcedil;ine un num&abreve;r prim, &scedil;i s&abreve; se afi&scedil;ze un mesaj corespunz&abreve;tor.</li>
		<li>S&abreve; se afi&scedil;ze pe ecran factorul cu cea mai mare putere din descompunerea unui num&abreve;r natural de maxim 4 cifre.</li>
		<li>Se citesc dou&abreve; numere naturale de maxim 4 cifre a &scedil;i b. S&abreve; se determine maximul dintre cel mai mare divizor prim al lui a &scedil;i cel mai mic divizor propriu al lui b.</li>
		</ol>
	</li>
	<br/><li><b>C.m.m.d.c</b>
		<ol>
		<li>S&abreve; se determine cel mai mare multiplu comun a dou&abreve; numere naturale x &scedil;i y (de maxim 4 cifre), citite de la tastatur&abreve;.</li>
		<li>Se cite&scedil;te un num&abreve;r natural n (2&le;n&le;100). Se citesc apoi n numere naturale. S&abreve; se determine cel mai mare divizor comun al numerelor citite.</li>
		<li>S&abreve; se determine c.m.m.d.c. al oglinditelor numerelor x &scedil;i y (de maxim 9 cifre), citite de la tastatur&abreve;.</li>
		<li>Se citesc de la tastatur&abreve; 4 numere naturale de maxim 4 cifre, a, b, c, d. S&abreve; se determine media aritmetic&abreve; dintre c.m.m.d.c(a, b) &scedil;i c.m.m.m.c(c, d).</li>
		<li>Se citesc de la tastatur&abreve; 2 numere naturale x &scedil;i y de maxim 9 cifre. S&abreve; se calculeze suma cifrelor celui mai mare divizor comun al numerelor x &scedil;i y.</li>
		</ol>
	</li>
</ol>
		<br/><br/>
</div>

</body>

</html>

